import { useMediaQuery } from "@mui/material";
import React from "react";
import { useAuth } from "../context/AuthProvider";

const CheckoutPage = () => {
  const matchesTablet = useMediaQuery("(min-width: 768px)");
  const auth = useAuth();
  const { user } = auth;

  return (
    <div
      className="container"
      style={{
        direction: "rtl",
        display: "flex",
        flexDirection: matchesTablet ? "row-reverse" : "column",

        justifyContent: "space-between",
        lineHeight: "1.7",
      }}
    >
      {auth ? (
        <>
          <div style={{ marginBottom: !matchesTablet ? "3rem" : "0rem" }}>
            {console.log(auth)}
            <p>نام: {user.userName}</p>
            <p>ایمیل: {user.email}</p>
            <p>تلفن: {user.phoneNumber}</p>
          </div>
          <div>
            <h4>روشهای ارسال و هزینه ها</h4>
            <div>
              <h6>ارسال به تهران</h6>
              <p>
                اگر ساکن مناطق 22 گانه تهران هستید، سفارشات شما با توجه به زمان
                انتخابی شما (در صورتی که تعطیلات رسمی نباشد) آماده ارسال خواهد
                بود. روشهای ارسال شامل موارد زیر است:
              </p>
              <ul>
                <li>ارسال با پیک</li>
                <li>ارسال از طریق پست سفارشی</li>
                <li>ارسال بصورت سفارشی</li>
              </ul>
              <p>
                اگر جمع خرید شما بالاتر از 300 هزار تومان باشد و ساکن تهران
                باشید هزینه ارسال را پرداخت نخواهید کرد.
              </p>
            </div>
            <div>
              <h6>ارسال به شهرستان</h6>
              <p>
                سفارشات شهرستان پس از آماده سازی که نهایتاً یک روز بعد از ثبت
                سفارش آماده می شوند (در صورتی که تعطیلات رسمی نباشد) از طریق پست
                پیشتاز یا تیپاکس ارسال می گردد
              </p>
              <p>
                چنانچه سفارشات شما در حجم های بالا ثبت گردد، ارسال از طریق
                باربری ها انجام می گیرد. در این نوع از سفارشات، پس از آماده سازی
                که حداکثر طی 72 ساعت کاری انجام می شود، بسته ارسالی به باربری
                تحویل و تصویر رسید آن برای دریافت در محل برای شما ارسال می گردد.
              </p>
              <p>
                توجه داشته باشید در مواردی که ارسال توسط شرکت پست یا باربری توسط
                مشتری انتخاب می‌شود، مسئولیت ریو صرفاً تحویل سفارش بشکل سالم و
                در حداقل بازه زمانی به شرکت پست یا باربری و ارسال کد پیگیری برای
                مشتری است. در این موارد ریو مسئولیتی در قبال تاخیر در ارسال یا
                مشکلات احتمالی آن ندارد. در این موارد و به منظور احتیاط بیشتر،
                ریو کالا را بر اساس چارچوب شرکت پست یا باربری تا سقف ممکن بیمه
                می نماید تا نگرانی از بابت خسارت احتمالی برای مشتریان وجود
                نداشته باشد، اما در صورت بروز مشکل ریو پاسخگو و پرداخت کننده
                خسارت نمی باش
              </p>
            </div>
          </div>
        </>
      ) : (
        <p>please login!</p>
      )}
    </div>
  );
};

export default CheckoutPage;
